{
 "kind": "blogger#postList",
 "nextPageToken": "CgkIChiAg82why0QyEI",
 "items": [
  {
   "kind": "blogger#post",
   "id": "8081495031711533988",
   "blog": {
    "id": "8520"
   },
   "published": "2019-04-04T15:08:00-04:00",
   "updated": "2019-04-04T15:08:08-04:00",
   "etag": "iHf3yWDE_geBgZ8U7rgZ_xuTeAQ/dGltZXN0YW1wOiAxNTU0NDA0ODg4NzcxCm9mZnNldDogLTE0NDAwMDAwCg",
   "url": "http://pyfound.blogspot.com/2019/04/update-on-python-in-education-proposal.html",
   "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/8081495031711533988",
   "title": "Update on the Python in Education Proposal Phase",
   "content": "In January when we launched the Python in Education project, we were a bit too ambitious with our timeline. Due to other commitments, we were not able to stick to the original time frame.Here is the revised timeline:April 4 - May 9: Request for Proposals phaseMay 10 - May 31: Review processJune 1: Notify the accepted proposalsJune-August of 2019: Accepted proposal work beginsWe'd also like to take this opportunity to inform everyone interested in submitting a proposal that we selected three categories we'd like to see proposals on. Additionally, we'd like to share the evaluation rubric we will use when reviewing each proposal. Proposal categoriesAfter reviewing all of the ideas we received in the first phase of this project, we have narrowed the scope of the proposals to:resources (curriculums, evaluations, studies, multidisciplinary projects)localization (translations, global currency, global timestamps, etc)mobile (development on mobile devices)We ask that if you are considering submitting a proposal that it fall into one of these broad categories.Evaluation rubricEvery proposal we receive will be evaluated against this rubric. We are looking for proposals that adhere to the PSF's code of conduct, align with the PSF's mission, have international reach, are feasible, and pertain to underrepresented topics.If anyone has any questions, please contact us at edu-committee@python.org. ",
   "author": {
    "id": "18334325508115717169",
    "displayName": "Ewa Jodlowska",
    "url": "https://www.blogger.com/profile/18334325508115717169",
    "image": {
     "url": "//lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35"
    }
   },
   "replies": {
    "totalItems": "0",
    "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/8081495031711533988/comments"
   }
  },
  {
   "kind": "blogger#post",
   "id": "2562968958598269587",
   "blog": {
    "id": "8520"
   },
   "published": "2019-03-27T10:00:00-04:00",
   "updated": "2019-03-27T10:00:04-04:00",
   "etag": "'iHf3yWDE_geBgZ8U7rgZ_xuTeAQ/dGltZXN0YW1wOiAxNTUzNjk1MjA0MDQzCm9mZnNldDogLTE0NDAwMDAwCg'",
   "url": "http://pyfound.blogspot.com/2019/03/puppy-presents-its-1st-annual-benefit_27.html",
   "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/2562968958598269587",
   "title": "PuPPy Presents its 1st Annual Benefit featuring Guido van Rossum",
   "content": "PuPPy Presents its 1st Annual BenefitA historic discussion of programming language creators aboutthe past and future of language design.April 2, 2019, 5:30 - 9:30 PMThe Collective Seattle400 Dexter Ave N.Seattle, WA 98109Featuring Language CreatorsJames Gosling - JavaAnders Hejlsberg - Turbo Pascal, C#, TypeScriptGuido van Rossum - PythonLarry Wall - PerlSummaryPuPPy, Seattle's Puget Sound Programming Python user group, presents its 1st annual charity event. The event will feature the creators of C#, Java, Perl, Python, and TypeScript in a conversation about programming language design. The charity event brings together this unique group of computer science pioneers, unlike any event held before. These great minds come together for what will surely be a fantastic night of discussion, as the panel delves into the past and future of programming language creation. The event will attract innovators and engineers from Seattle, the nation’s fastest growing technology hub.The event is a benefit for CSforALL, a non-profit organization that represents more than 500 members who are educators, content providers, funders and researchers who share a vision for all students in the U.S. to learn computer science. CSforALL provides leadership and guidance that helps the K-12 education community implement computer science initiatives, draw from best practices and connect with national organizations to expand access to all students in the U.S.The event follows in the spirit and culture of PuPPy, the producers of this benefit, as an inclusive community. The very first PuPPy meeting 54 months ago was a mini-conference that featured discussions on allyship and helping more women join the ranks of software professionals. Event tickets and further details are available at: http://bdfl-gift.pspython.com.SpeakersCyrus Habib - Washington State Lieutenant Governor - Opening remarksCyrus Habib was elected Washington State’s 16th Lieutenant Governor in November 2016 at the age of 35. He had previously been elected to the State House of Representatives in 2012 and the State Senate in 2014, where he was Democratic Whip and a member of the Democratic leadership team. As Lt. Governor, he is President of the State Senate, serves as Acting Governor whenever Governor Inslee leaves the state, and oversees an agency whose key issues include economic development, trade, and higher education.A three-time cancer survivor, Lt. Governor Habib has been fully blind since age eight. His parents immigrated to the U.S. from Iran before he was born, and he is the first and only Iranian-American to hold statewide elected office in the United States.Carol Willing - ModeratorCarol Willing serves as a Steering Council member for Project Jupyter. She received the 2017 ACM Software System Award for Jupyter's development. She is also a member of the inaugural Python Steering Council, a Python Software Foundation Fellow and former Director; a core developer on CPython, Jupyter, nteract, AnitaB.org’s open source projects, and PyLadies; a co-organizer of PyLadies San Diego and San Diego Python User Group; an independent developer of hardware and software. Weaving her love of art, music, and nature with wearable soft circuits, she is developing an open hardware project to assist an in-home caregiver with gentle, compassionate support of a loved one with Alzheimer’s.James Gosling - JavaJames A. Gosling, O.C., Ph.D. (born May 19, 1955, near Calgary, Alberta, Canada) is a famous software developer, best known as the father of the Java programming language.In 1977, James Gosling received a B.Sc in Computer Science from the University of Calgary. In 1983, he earned a Ph.D. in Computer Science from Carnegie Mellon University, and his doctoral thesis was titled 'The Algebraic Manipulation of Constraints'. While working towards his doctorate, he wrote a version of emacs (gosmacs), and before joining Sun Microsystems he built a multi-processor version of Unix[1] while at Carnegie Mellon University, as well as several compilers and mail systems. Since 1984, Gosling has been with Sun Microsystems.He is generally credited as the inventor of the Java programming language in 1991. He did the original design of Java and implemented its original compiler and virtual machine. For this achievement, he was elected to the United States National Academy of Engineering. He has also made major contributions to several other software systems, such as NeWS and Gosling Emacs. He also co-wrote the 'bundle' program, a utility thoroughly detailed in Brian Kernighan and Rob Pike's book, 'The Unix Programming Environment'.Anders Hejlsberg - Turbo Pascal, C#, TypeScriptAnders Hejlsberg is a Microsoft Technical Fellow and has been designing and implementing programming languages and development tools for over 35 years. Anders is the lead architect of the TypeScript open-source project and the original designer of the C# programming language. Before joining Microsoft in 1996, Anders was a Principal Engineer at Borland International. As one of the first employees of Borland, he was the original author of Turbo Pascal and later worked as the Chief Architect of the Delphi product line. Anders studied Engineering at the Technical University of Denmark.Guido van Rossum - PythonGuido van Rossum is the creator of Python, one of the major programming languages on and off the web. Recently Guido retired as Benevolent Dictator For Life (“BDFL”) of Python, a title seemingly stolen from a Monty Python skit. Details of his decision were featured in an Economist article. Guido thankfully has joined the Python Steering Council. This five-person group will give guidance to the future roadmap of the Python programming language.Van Rossum moved from the Netherlands to the USA, in 1995. He met his wife after his move. Until July 2003 they lived in the northern Virginia suburbs of Washington, DC with their son Orlijn, who was born in 2001. They then moved to Silicon Valley where Guido worked for a variety of companies including Google in the past and currently at Dropbox (spending 50% of his time on Python!).Larry Wall - PerlLarry Wall was educated at various places including the Cornish School of Music, the Seattle Youth Symphony, Seattle Pacific University, Multnomah School of the Bible, SIL International, U.C. Berkeley, and UCLA. Though trained primarily in music, chemistry, and linguistics, Larry has been working with computers for the last 40 years or so. He is most famous for writing rn, patch, and the Perl programming language, but prefers to think of himself as a cultural hacker whose vocation in life is to bring a bit of joy into the dreary existence of programmers. For various definitions of “work for”, Larry has worked for Seattle Pacific, MusiComedy Northwest, System Development Corporation, Burroughs, Unisys, the NSA, Telos, ConTel, GTE, JPL, NetLabs, Seagate, Tim O’Reilly, the Perl Foundation, Broadcom, and himself. He is currently serving as Artist in Residence for Craigslist.About CSforAllhttps://www.csforall.org/media-faq/CSforALL, shorthand for “Computer Science for All,” is the central hub for the K-12 national computer science education movement. CSforALL is the community organizer of school districts, nonprofits, government agencies and corporations that share the goal of rigorous, inclusive and sustainable CS education in the U.S.About PuPPyhttps://www.pspython.com/app/PuPPy is a fun and friendly user group dedicated to proliferating a diverse and talented Python community in the Puget Sound region. We are devoted to exploring Python-based programming knowledge, embracing new and experienced members from all walks of life, and helping those members to achieve their professional goals.Event LeadershipRuthe Farmer – Event Chair - Chief Evangelist for CSforALLCarol Willing – Moderator -- Steering Council member and developer for Project Jupyter and PythonLorena Mesa – Vice Chair -- GitHub Data Engineer - Software Intelligence Systems | PyLadies Chicago Organizer | Python Software Foundation DirectorEloisa Tran -- Fundraising Chair -- Founder of the Women in Data Science WiDS, Data Scientist for City of Bellevue",
   "author": {
    "id": "08560693365188941302",
    "displayName": "Lorena Mesa",
    "url": "https://www.blogger.com/profile/08560693365188941302",
    "image": {
     "url": "//lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35"
    }
   },
   "replies": {
    "totalItems": "0",
    "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/2562968958598269587/comments"
   }
  },
  {
   "kind": "blogger#post",
   "id": "2143552786370654151",
   "blog": {
    "id": "8520"
   },
   "published": "2019-03-13T11:55:00-04:00",
   "updated": "2019-03-14T11:50:47-04:00",
   "etag": "'iHf3yWDE_geBgZ8U7rgZ_xuTeAQ/dGltZXN0YW1wOiAxNTUyNTc4NjQ3NDEzCm9mZnNldDogLTE0NDAwMDAwCg'",
   "url": "http://pyfound.blogspot.com/2019/03/commencing-security-accessibility-and.html",
   "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/2143552786370654151",
   "title": "Commencing Security, Accessibility, and Internationalization Improvements to PyPI for 2019",
   "content": "The Python Software Foundation (PSF) and PSF Packaging Working Group are excited to announce that the first round of slated improvements to PyPI for 2019 are underway. This Open Technology Fund funded project will bring improvements to the accessibility and security of the service. You can read more about the scope of this project in our request for proposals document.We are excited to have two returning contractors from the MOSS funded work that brought the full rewrite of PyPI into production.Kabu CreativeResponsible for the user interface and user experience of PyPI, Kabu Creative will be fulfilling those aspects of new features for the project. Additionally, we are excited for their work on auditing and improving the accessibility of PyPI's web user interface.Changeset Consulting, LLCWith experience in project management, communications, and contributions for projects and teams across the realm of open source, Changeset Consulting will be responsible for helping to lead the project to completion. Along the way Changeset Consulting will also be performing reporting, communications, and outreach to help keep the Python community up to speed on how the project is progressing.We are also welcoming a new contractor to the team to complete this project.Trail of BitsBringing their experience securing organizations and products, Trail of Bits will be handling the backend development related to the security milestones of the project, as well as the backend development necessary for implementing internationalization of the PyPI user interface.The PSF looks forward to sharing more here as features are developed and deployed to PyPI. Subscribe to pypi-announce for announcements of big changes to PyPI, and follow this blog for updates as the work progresses.",
   "author": {
    "id": "13577459520968677064",
    "displayName": "Ernest W. Durbin III",
    "url": "https://www.blogger.com/profile/13577459520968677064",
    "image": {
     "url": "//lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35"
    }
   },
   "replies": {
    "totalItems": "0",
    "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/2143552786370654151/comments"
   },
   "labels": [
    "pypi"
   ]
  },
  {
   "kind": "blogger#post",
   "id": "5548628823543164006",
   "blog": {
    "id": "8520"
   },
   "published": "2019-02-22T09:00:00-05:00",
   "updated": "2019-02-22T09:00:10-05:00",
   "etag": "'iHf3yWDE_geBgZ8U7rgZ_xuTeAQ/dGltZXN0YW1wOiAxNTUwODQ0MDEwOTU1Cm9mZnNldDogLTE4MDAwMDAwCg'",
   "url": "http://pyfound.blogspot.com/2019/02/the-north-star-of-pycascades-core.html",
   "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/5548628823543164006",
   "title": "The North Star of PyCascades, core Python developer Mariatta Wijaya, receives the 2018 Q3 Community Service Award ",
   "content": "We in the Python community have a deep appreciation for the volunteers who organize, promote, and write the language. A phrase that has become a cornerstone of our community, afterall, ‘Come for the language, stay for the community’ (derived from Python core developer Brett Cannon’s opening remarks at PyCon 2014), reflects the passion of our community and more so of the countless volunteers building our community.One volunteer who has been steadfast in actively building the Python community - from her contributions to CPython to her work as an organizer and co-chair of PyCascades 2018 and more - is Mariatta Wijaya. We at the Python Software Foundation are pleased to name Mariatta Wijaya as a 2018 Q3 Community Service Award recipient:RESOLVED, that the Python Software Foundation award the Q3 2018 Community Service Award to Mariatta Wijaya for her contributions to CPython, diversity efforts for the Python Core Contributor team, and her work on PyCascades. Come talk! The path to becoming a Core Python Developer At Montreal PyCon 2015, Guido Van Rossum delivered the closing keynote during which Guido issued a public ask, “I want at least two female Python core developers in the next year ... and I will try to train them myself if that's what it takes. So come talk to me.' Consequently, Mariatta did just that, she reached out to Guido after PyCon 2016 to learn more about starting in Python core development. Mariatta recalls, “I hadn’t contributed to open source [yet] and I wanted to know how to start”. Guido recommended some ways for Mariatta to start including reviewing the dev guide, looking at open issues and joining and introducing herself on the Python dev mailing list .Following Guido’s advice, Mariatta “read the issues [to] see if there is anything I can help with, anything that interests me ... [when I learned that] Brett was starting migration [of Python] to GitHub”. As an engineer at Zapier, Mariatta has a background in web development so the migration provided an initial issue she could begin to explore. Mariatta has since contributed to several bots that improve the workflows for Python contributors and core developers, reviewed and merged 700+ PRs to Python, and is Co-Chair of the Language Summit in 2019 and 2020. Some examples of bots she has written include cherry-picker, a “tool used to backport CPython changes from master into one or more of the maintenance branches”. Additionally, Mariatta is the author of PEP-581: Using GitHub Issues for CPython. Her motivations behind this PEP again come back to improving the core Python development processes, “I think it will be more beneficial to use an out of the box issue tracker like GitHub as it will allow core developers to focus on developing and contributing”. A role model for us all: Increasing the diversity of the Core Python Development teamThe recent departure of Guido as BDFL and the subsequent discussion about the future governance of core Python led to several suggestions, with the Steering Council ultimately becoming the chosen model. Core Python developer Victor Stinner along with several others nominated Mariatta to the Steering Council. In Victor’s nomination he explains, “Mariatta became the first woman core developer in Python [in 2017]. She is actively sharing her experience to encourage people from underrepresented groups to contribute to Python.” The work required to become a core developer is laborious yet Mariatta has continuously gone the extra mile to lead by example and be active in public outreach. “Mariatta is my role model for mentoring and diversity which is helping a lot to get more people involved in Python,” Victor adds. Python core developer and Steering Council member Carol Willing echoed this sentiment sharing, “Mariatta works to share Python and its possible uses with others. Her blend of hard work, enthusiasm, and caring have welcomed many into the Python Community,”Mariatta’s PyCon 2018 talk titled, “What is a Core Python Developer” is an ideal example of Mariatta’s dedication to building a more diverse core Python team. Beginning with a question, “do you use f’strings” (Mariatta is a known avid fan of f’strings, she even has stickers for them) Mariatta dives into a talk about what the pathway is for core (and contributing) developers ultimately commenting on the very real, stark gender imbalance within the core team, “We have 848 contributors to Python, less than 10 are women. We have 89 core developers, only 2 are women ... This is real but this is also wrong. This is not the right representation of our community”.  While this number is starting to change as more women are promoted to core development (Cheryl Sabella’s promotion this week ups the number of women core developers up to 5 out of 97), Mariatta has continued to be a champion and advocate for diversity and inclusion in the core development team. Even the captionist in Mariatta's PyCon 2018 (seen below in tweets) talk captured their appreciation for Mariatta's dedication.Heard a story today that brought me to tears. A talk I did at #PyCon in 2014 inspired a woman to become involved in the community, speak, and become a core contributor. Diversity is important.@mariatta Thank you for sharing. The python was in you all along(@nnja) May 12, 2018Yes you are amazing @mariatta thank you for your work, your contributions, for sharing your story. Our #python community is better because of people like you. #pycon2018 pic.twitter.com/84FvYr4dSq— Loooorena Mesa @ The Cosmos  (@loooorenanicole) May 12, 2018Awesome talk on becoming a python core developer by the amazing @mariatta. More women need to contribute to CPython and they can look to @mariatta for advice. Please spread the word. @pycon #pycon #pycon2018.— saptarshikar (@saptarshikar) May 12, 2018The North Star of PyCascades Outside of her contributions to CPython, Mariatta has been an active organizer with PyCascades - a regional Python conference now about to kick off its second conference this week. The inaugural 2018 conference, held in Mariatta’s hometown Vancouver, Canada, introduced a a single track format with 30 minute talks, no question and answer, and includes lightning talks. Inspired by the single track format of Write the Docs and DjangoCon Europe, this format was not only an easier way to get a new conference off the ground but, as Mariatta observed, “is able to give [speakers] the large audience they deserve”. This format also makes it easier for attendees to navigate. Co-Chairing the conference with Mariatta in 2018, Seb Vetter remarked, “Mariatta has been THE driving force behind PyCascades in the inaugural year”. As a co-chair Mariatta helped respond to many last minute issues such as when, the day before the conference at 10:00am local time, Guido informed the organizers he was unable to obtain a visa to travel to speak at PyCascades. Within a few hours, the team setup for Guido to speak remotely, had sent him a badge, when the team learned Guido would be able to attend after all! “When we found out he's coming, we printed one more badge for him. That's why he has multiple badges,” Mariatta explained. Juggling many changing priorities is the life of an organizer. Yet each decision made, “she ensured … considered the potential impact on the diversity of the conference,” Seb remembered adding, “[Mariatta] seems to have an endless stream of enthusiasm and energy and was our North Star for doing everything we could to make it as inclusive for attendees as possible”. The idea of Mariatta acting as a North Star was echoed by PyCascades organizer Don Sheu adding, “she gives voice to folks that aren’t sufficiently represented in tech … [as a part of] PyCascades founding team, Mariatta’s influence is creating a safe environment”.With PyCascades 2019 happening in Seattle this upcoming weekend (February 23 - 24), Mariatta is again contributing as an organizer.What do f-string stickers and food have in common? Mariatta’s love of them!Outside of Python, when asked what else Mariatta likes to do she simply responded, “I love food!”. And her favorite food? Asian cuisine. #IceCreamSelfie at North Bay Python 2018. Source: https://mariatta.ca/img/ics-northbaypython-2018.jpg.If you happen to see Mariatta at an event, say hi. Maybe she’ll have f-string sticker for you!I've just ordered more f-string stickers in preparation for #PyCascades2019 — Mariatta  (@mariatta) January 15, 2019",
   "author": {
    "id": "08560693365188941302",
    "displayName": "Lorena Mesa",
    "url": "https://www.blogger.com/profile/08560693365188941302",
    "image": {
     "url": "//lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35"
    }
   },
   "replies": {
    "totalItems": "0",
    "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/5548628823543164006/comments"
   }
  },
  {
   "kind": "blogger#post",
   "id": "8198454443597546939",
   "blog": {
    "id": "8520"
   },
   "published": "2019-02-11T13:00:00-05:00",
   "updated": "2019-02-12T04:23:11-05:00",
   "etag": "'iHf3yWDE_geBgZ8U7rgZ_xuTeAQ/dGltZXN0YW1wOiAxNTQ5OTYzMzkxNDU5Cm9mZnNldDogLTE4MDAwMDAwCg'",
   "url": "http://pyfound.blogspot.com/2019/02/python-community-service-award-q3-mario.html",
   "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/8198454443597546939",
   "title": "Python Community service award Q3: Mario Corchero",
   "content": "The PSF community service awards go to those individuals whose work and commitment complement and strengthen the PSF mission: to support and facilitate the growth of a diverse global Python community. So when thinking about individuals that go above and beyond to support the global community Mario Corchero is a name that comes easily to mind. Not only is Mario a Senior Software Engineer for Bloomberg but he also devotes incredible amounts of his time to organise PyCon ES (Spain), PyLondinium, and more recently, the Spanish speaking track of PyCon: Las Pycon Charlas.Mario is the true embodiment of the Python community spirit and for this reason, the  Python Software Foundation has awarded Mario Corchero with the Q3 2018 Community Service Award.RESOLVED, that the Python Software Foundation award the Q3 2018 Community Service Award to Mario Corchero for helping organize PyLondinium, the PyCon Charlas track, and PyCon Spain.Mario's contributions to the Python CommunityPyConESWith the growing popularity and global adoption of Python there also comes the need to bring together diverse community groups. Although large events such as  PyCon US are incredibly important in bringing these groups together, these are not always accessible to the whole community. Smaller, localized events such as Python ES, France, Namibia, Colombia, and many many others help with the goal of bringing cohesion to the global community. According to David Naranjo (co-organiser of PyConES), PyConES was the first event of this kind that he and Mario attended together. They loved it so much that while at PyConES16 they decided to submit an application to organise and bring this event to their region: Extremadura.On top of the many challenges that come with organising an event of this type (i.e. drafting the programme, getting talks accepted, running the event on the day), they have faced an additional layer of complexity: neither of them lives in the region anymore.This has made the organisation of PyConES a true community effort: from the organising committee to the sponsors and the volunteers that work together to make this a huge success. PyConEs is now a  staple Python event in Europe with more than 600 attendees every year, and it owes its success in a great deal to Mario’s efforts.PyLondiniumA year after organising his first PyConES, Mario embarked on yet another journey: the organisation of PyLondinium. An event focused on showcasing the many use cases of Python as opposed to other events such as the PyData events. PyLondinium is not only focused on bringing together the Python community but also to raise money for the PSF and its programmes around the world. In this particular case, Bloomberg, a long-time Python supporter, has played an important role in the success of the event. Not only do they host the event at their Europe headquarters in the heart of London but they also help to cover some of the costs as the main event sponsor, keeping the ticket prices at an affordable level.Pylondinium 2018Accessibility for the wider communityAs a passionate community builder, from a non-English speaking country, localization and accessibility of the Python language is something that matters to Mario. Most of the coding resources out in the world are written in English, which can be a barrier to those whose primary language is not English or simply do not speak the language at all. That is why when he was presented with the opportunity to chair the Spanish track of PyCon US 2017 (Las PyCon Charlas) he did so wholeheartedly, embarking into yet another community journey alongside PSF Director Naomi Ceder.Again, like his other endeavours, Las Charlas was an absolute success. It gathered people from all over from Latin America and Spain for a full day of talks in Spanish on such topics as machine learning,  astronomy and security. In fact, it was such a success that the Charlas is back this coming year and the organisers are already receiving talks submissions (for more details visit https://us.pycon.org/2019/speaking/). PyCon Charlas 2018When asked why he organises all of these events, his answer is rather simple and honest. It is usually driven by a ‘how come no one is doing this yet?’' says Mario. But when digging deeper it becomes evident that Mario’s motivations lie in bringing the community together and nurturing it. Mario is extremely dedicated to the community and helping others to get involved. From creating Spanish tracks for PyCon USA or creating events serving specific areas or regions, Mario is constantly finding ways to bring Pythonistas together. ",
   "author": {
    "id": "18233146827900730874",
    "displayName": "Tania Allard",
    "url": "https://www.blogger.com/profile/18233146827900730874",
    "image": {
     "url": "//lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35"
    }
   },
   "replies": {
    "totalItems": "0",
    "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/8198454443597546939/comments"
   }
  },
  {
   "kind": "blogger#post",
   "id": "8027978529149113176",
   "blog": {
    "id": "8520"
   },
   "published": "2019-02-11T08:59:00-05:00",
   "updated": "2019-02-11T13:14:35-05:00",
   "etag": "'iHf3yWDE_geBgZ8U7rgZ_xuTeAQ/dGltZXN0YW1wOiAxNTQ5OTA4ODc1MTYzCm9mZnNldDogLTE4MDAwMDAwCg'",
   "url": "http://pyfound.blogspot.com/2019/02/the-steady-leader-of-python-community.html",
   "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/8027978529149113176",
   "title": "A Steady Leader of the Python Community, Alex Gaynor, Receives Community Service Award",
   "content": "Going through the big names in the Python community, one would not likely miss Alex Gaynor. Alex was Director of both the Python Software Foundation as well as the Django Software Foundation, and he is currently an Infrastructure Staff member of the PSF. Overall, Alex has been a valuable member of the Python community, contributing to the structure of the PSF on an administrative level, and actively encouraging the growth of Python through his personal efforts.For this reason, the Python Software Foundation has awarded Alex Gaynor the Q3 2018 Community Service Award:RESOLVED, that the Python Software Foundation award the Q3 2018 Community Service Award to Alex Gaynor for his contributions to the Python Community and the Python Software Foundation. Alex previously served as a PSF Director in 2015-2016. He currently serves as an Infrastructure Staff member and contributes to legacy PyPI and the next generation warehouse and has helped legacy warehouse in security (disabling unsupported OpenID) and cutting bandwidth costs by compressing 404 images.Alex attended Rensselaer Polytechnic Institute, where he received his Bachelor of Science degree in Computer Science. Originally from Chicago, he is currently living in Washington DC. In the past, Alex worked for the United States Digital Service on various impactful projects such as the United States Refugee Admissions Program and the Veterans Affairs disability benefits appeals process. He is now working for Mozilla on their Firefox Security Team.Alex originally began contributing to the Python community by serving on the PyCon programming committee. “I was fortunate that right after I joined the community PyCon was in my hometown of Chicago, which made it easy to get involved.” Alex then decided to take up the responsibility of being a Director of the Python Software Foundation when the organization was going through many changes. “[W]e were adopting a Code of Conduct, starting to work on the new membership model, and significantly growing the grant funding we were offering. I think my proudest accomplishment is being a part of the team that kept all of these great initiatives on the rails (I certainly can't take credit for any of them on my own!); since my time the PSF has significantly scaled up its ability to help guide and support the global Python community.”Aside from his contributions to the Python Software Foundation, Alex also served as a Director of the Django Software Foundation and a member of the Django core team. As mentioned in the resolution above, Alex is currently working as a PSF Infrastructure Staff member where he is working on legacy PyPI and the next generation warehouse. Alex has improved the legacy warehouse in security by disabling unsupported, the open standard and decentralized authentication protocol OpenID, as well as in cutting bandwidth costs by compressing 404 images.Being on the PSF Infrastructure team with Alex, Director of Infrastructure Ernest W. Durbin III has enjoyed working with him and appreciates his contributions to the team:“Alex has been one of the most steady and reliable motivators for improved security throughout our entire community. Alex stays ruthlessly up to date on current best practices and makes a consistent effort to help encourage and implement pragmatic security at all levels. While far from an exhaustive list, the Python community can thank Alex for his advocacy and knowledge on rock solid TLS for pypi.org, sharing his knowledge and experience with the Python Security Response Team, and contributions to security in the Python language as well as core cryptographic libraries on PyPI.”Glyph Lefkowitz, creator of the Twisted framework, additionally observed that Alex’s contributions across multiple projects, from PyCA's Cryptography, to Django, to CPython, to PyPy to Twisted, have been transformational for the Python ecosystem, and have, in particular, made it a much safer and more secure community for users. “When he sees a problem that needs addressing, his willingness to work across projects and layers is an ongoing source of inspiration for everyone that calls themselves a 'maintainer',” noted Glyph.As a long-time member of the Python community, Alex says what he appreciates most about the community is its commitment to getting more people involved in Python specifically, and programming in general. He is particularly impressed by the PSF’s efforts to support the growth of Python on multiple scales. “I don't think there's any organization like the PSF that does as much work issuing grants and supporting local groups teaching getting people involved in coding and Python.”Moving forward, Alex hopes to see more knowledge being shared regarding potential funding in the community. “From PyPI to PyCon and beyond there's a lot of costs associated with making these community resources happen, and we've learned a lot about how to raise money to make them happen. I think we could do a better job sharing these lessons learned with the broader open source ecosystem and helping to push new innovation in this space.”Additionally, to anyone out there looking to make impactful contributions to our community, Alex’s advice is to simply jump in and contribute in whatever ways that work for you. With numerous volunteering opportunities with the PSF working groups, local meetups, regional conferences, and many more, it is easier than ever to be a part of, and help promote the Python community.As the final note, the PSF would like to congratulate Alex Gaynor again for this prestigious award, and thank him for his continued contributions to our organization in particular, and to the general Python community as a whole.",
   "author": {
    "id": "g108919881430753393805",
    "displayName": "Unknown",
    "url": "https://www.blogger.com/profile/13762514365185614148",
    "image": {
     "url": "//lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35"
    }
   },
   "replies": {
    "totalItems": "0",
    "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/8027978529149113176/comments"
   }
  },
  {
   "kind": "blogger#post",
   "id": "4601118125822706824",
   "blog": {
    "id": "8520"
   },
   "published": "2019-02-06T08:44:00-05:00",
   "updated": "2019-02-06T08:44:26-05:00",
   "etag": "'iHf3yWDE_geBgZ8U7rgZ_xuTeAQ/dGltZXN0YW1wOiAxNTQ5NDYwNjY2MjA1Cm9mZnNldDogLTE4MDAwMDAwCg'",
   "url": "http://pyfound.blogspot.com/2019/02/python-brasil-people-technology.html",
   "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/4601118125822706824",
   "title": "Python Brasil – People > Technology",
   "content": "It's October 17th, 2018. I've arrived at Natal, a beautiful coastal city in Brazil's northeast region. Known for its beaches and hotness, it's surprising how I'm not thinking about all the Caipirinhas I'm going to drink at the shore after the conference. My excitement is because I'm going to attend Python Brasil[14]!After six months out of my home country, I'm thrilled to once again join this conference, now as an attendee and speaker. It's only my second edition – out of prior fourteen – but enough to know how great Python Brasil is. Full of amazing people, talks, tutorials and evening happy hours, this is possibly the most fun Python conference in the world. Seriously.It's bigLasting for 6 days, 784 people attended the event. Out of that, 153 were women and about 120 students. Within 4 different tracks, there were about 120 talks, 30 lightning talks and 6 keynotes, being the first Python Brasil to livestream the whole main conference. Additionally, 5 tutorials, 1 sprint day and 1 independently organized Django Girls were held for those wanting more practical hands on. All of this was possible due to an outstanding organization team and the support and sponsorship from 8 entities.It's incredible how the biggest Python Brasil ever still feels so much like a family.A beginner friendly conferenceWelcoming beginners is one of the pillars in this community. To make it happen, the organization team created a specially priced ticket pack for the IFRN (Federal Institute of Rio Grande do Norte), allowing them to bring over 120 young students from 3 different cities. It was beautiful to see all these students around, watching talks, talking to the speakers and enjoying every moment of the conference. During the sprints, a group of students learned about data scraping. In a world where it is very hard to capture the attention of youths, it was fascinating to witness how they were so focused on learning. It demonstrates how a small gesture – like discounts on a ticket – can change people's lives.To express their gratitude, one of the students wrote and presented during the lighting talks a Python Brasil themed Cordel – a pamphlet with novels, poems and songs, very popular in that region – bringing some of the attendees to tears.Student presenting the CordelFinancial AidBesides the support for the students cited above, tickets were granted for people unable to pay for them. To justify the concession, the person needed to tell their history. After reviewing the applications, 6 out of 7 tickets were donated.Let's talk about Open DataA different keynote was presented on the second day: a panel about Open Data and Civic Technologies. Mediated by Mário Sérgio, five participants discussed topics like what is open data, how our legislation is currently dealing with it, tackling fake news, and what the expectations for the future are. In the light of Brazil's last election – which also happened in October – it was a perfect moment to create a debate and demystify the subject.From left to right: Mario Sérgio, Álvaro 'Turicas', Judite Cypreste, Letícia Portella, Eduardo Cuducos and Fernando MassanoriPyLadiesBRConfThe first PyLadiesBRConf was organized to celebrate the PyLadies Brasil 5 year anniversary. The motto of the conference was to help more women become active members of the Python community, inspiring those who were recently getting involved.Independently organized by the PyLadies, the conference happened one day before Python Brasil. The event was totally free, receiving about 120 women, with 8 speakers and ending in a fishbowl discussion. Likewise, the whole organization committee was formed only by women volunteers.The main organizer, Débora Azevedo, said that it was five years cultivating the community, involving a lot of hard work to get them to this point.PyLadiesBRConf official photoPyLadies at Python BrasilDorneles Treméa AwardNamed after the founder of the Python Brasil Association, the award is a tribute to Dorneles Treméa, a developer, community member, and open source leader, always willing to help and share his knowledge, who sadly passed away in a car accident in 2011. The award is given to the member or members of the Python Brazilian community who keep alive the spirit of collaboration, entrepreneurship, and commitment.In this edition of Python Brasil, it was given to Filipe Cifali, Humberto Rocha and Rudá Porto Filgueiras, for their incredible work at running and maintaining the Python Brasil and the Python Brasil Association online infrastructure.Filipe Cifali receiving the Dorneles Treméa AwardThe Challenges and the Future, by the StaffAccording to the organization committee, scalability and inclusiveness were the biggest challenges for running the conference this year.Ítalo Rossi, the Big Kahuna (chair):'The conference was initially planned for 400 attendees, but we ended up with it with 784. Adapting the budget, venues, and logistics was a big challenge.'Ítalo Monteiro:'The challenge was to promote the best infrastructure for the biggest Python Brasil in history, making it a safe space for everyone, not accepting any kind of prejudice or intolerance.'When asked about the future of the conference and the community, all of the organizers said they wanted to improve the diversity of the event even further. Having more women attending and speaking, more participation of beginners and more involvement of minorities. Additionally, they all want to have a bigger and more united community, believing in its growth, visibility, and engagement.People > TechnologyMy first contact with the Python community was at Python Brasil in 2016 and it changed my life.A lot of the experiences and opportunities that I had – personally and professionally – came from being part of it. It's not just about the technology, it's about the people.Of course, this wasn't the whole conference, there's no way to cover every amazing thing that happened there. At least, I hope to get you excited to go to the next one!I'd like to say thanks to all the organization committee and everyone involved in putting together this superb conference and helping me with this article.Python Brasil official photo.The sign represents Python in BSL (Brazilian Sign Language), made by Amanda and Sávio at Python Sul 2018You can take a peek at this wonderful conference’s photos and videos.The Python Brasil[15] will happen at Ribeirão Preto, in São Paulo. Date still to be confirmed.",
   "author": {
    "id": "g107901767560752445008",
    "displayName": "Unknown",
    "url": "https://www.blogger.com/profile/06955860548417295759",
    "image": {
     "url": "//lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35"
    }
   },
   "replies": {
    "totalItems": "0",
    "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/4601118125822706824/comments"
   }
  },
  {
   "kind": "blogger#post",
   "id": "3799897720152876114",
   "blog": {
    "id": "8520"
   },
   "published": "2019-02-05T12:39:00-05:00",
   "updated": "2019-02-05T12:39:22-05:00",
   "etag": "'iHf3yWDE_geBgZ8U7rgZ_xuTeAQ/dGltZXN0YW1wOiAxNTQ5Mzg4MzYyNzU3Cm9mZnNldDogLTE4MDAwMDAwCg'",
   "url": "http://pyfound.blogspot.com/2019/02/python-developers-survey-2018-results.html",
   "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/3799897720152876114",
   "title": "Python Developers Survey 2018 Results: Learn about the community",
   "content": "In the fall of 2018, the Python Software Foundation together with JetBrains conducted the official annual Python Developers Survey for the second time. Much like the previous survey, we set out to identify the latest trends and gather insight into how the world of Python development looks . Over twenty thousand developers from more than 150 different countries participated last year to help us map out an accurate, up-to-date landscape of the Python community. That is more than twice as many Python users participating in 2018 as in 2017. We are super-excited to share the results of the survey with you!View the results of Python Developers Survey 2018! We hope the survey findings will help all of us better understand the current state of the Python developer community, see the big picture, and answer some potential questions. Find out about the most popular types of Python development, trending frameworks, libraries and tools, additional languages used together with Python, adoption rates of different Python versions, and gain many other insights into the world of Python.We couldn’t include all the potential findings into the report without bloating it. If you have specific questions that are unanswered, send them to us and we’ll dig into the data for an answer. Or if you want to delve into the data yourself, we’re also sharing the raw survey data, which anyone can use to arrive at their own conclusions and additional findings.We’re excited to see and share your findings! Please share them on twitter or other social media mentioning @jetbrains‏ and @ThePSF with the #pythondevsurvey hashtag. We’re open to any suggestions and feedback related to the survey so we can run an even better one next time. Huge thanks to all the participants of the survey and to the amazing team at PSF and JetBrains that worked hard to make this happen!",
   "author": {
    "id": "18334325508115717169",
    "displayName": "Ewa Jodlowska",
    "url": "https://www.blogger.com/profile/18334325508115717169",
    "image": {
     "url": "//lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35"
    }
   },
   "replies": {
    "totalItems": "0",
    "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/3799897720152876114/comments"
   }
  },
  {
   "kind": "blogger#post",
   "id": "9116452149837546851",
   "blog": {
    "id": "8520"
   },
   "published": "2019-01-24T09:58:00-05:00",
   "updated": "2019-01-24T09:58:08-05:00",
   "etag": "'iHf3yWDE_geBgZ8U7rgZ_xuTeAQ/dGltZXN0YW1wOiAxNTQ4MzQxODg4MDQzCm9mZnNldDogLTE4MDAwMDAwCg'",
   "url": "http://pyfound.blogspot.com/2019/01/python-in-education-request-for-ideas.html",
   "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/9116452149837546851",
   "title": "Python in Education - Request for Ideas ",
   "content": "The Python Software Foundation Board Committee for Python in Education wants to hear how the PSF can help members of our community increase the presence of Python in education.Our first goal is to gather ideas from the community on ways the PSF can fund work to improve Python in education. We want to collect a broad spectrum of ideas and projects at all levels and in all disciplines. After the ideas phase, we will use the ideas provided to guide our request for proposals.TimelineHere’s the full timeline:January 23- February 18, 2019: Request for Ideas phaseFebruary 18 - March 31, 2019: Request for Proposals phaseApril 1-17, 2019: Review processApril 18, 2019: Notify the accepted proposalsJune-August of 2019: Accepted proposal work beginsScopeThe scope of the “request for ideas” phase is vague on purpose. We do not want to steer the ideas brought forth and want to see a wide variety of pitches.Think small. If you had $100 USD what would you do? Think BIG! If you had $10,000,000 USD  what would you do? There is no limit to the amount of money that your pitch might cost. If we think you have a great idea and it serves to improve Python in education, we will support it. Smaller requests will       come from funds we have on hand. Larger funding requests will take more work to fulfill as we will work to gather funds through several methods such as donation drives and grants from other organizations. While the Request for Ideas is vague and open ended, there are some guidelines. These guidelines will come into play during the Request for Proposal phase, but they may help you in the Request for Ideas phase.Here are some things that we will look for and consider in a proposal:Basic requirementsThe criteria for acceptance will be based on the following guidelines:Does the proposal adhere to PSF’s Code of Conduct?Does the proposal align with the Python Software Foundation’s mission?Is the proposal well organized and detailed? Be sure to tell us what the main issue, problem, or subject is and why is it important. Does the proposer have any experience relevant to the proposal? While not strictly a requirement, having previous experience in what is being proposed will be considered in the overall application.Is the subject pertaining to underrepresented topics within our community? As we strive to improve the diversity of our community, priority will be given to proposals that bring new viewpoints and additional representation to the Python ecosystem.Advanced requirementsThe proposal should include a timeline and capture major milestones for the work being proposed.If the proposal includes assistance from other contributors/resources, please share the details.The proposal should include the expected outcomes of proposed work as well as metrics for how the outcomes will be evaluated.Submit your ideas and questions to edu-committee@python.org.Thank you for your time and we look forward to seeing all of the wonderful ideas!",
   "author": {
    "id": "18334325508115717169",
    "displayName": "Ewa Jodlowska",
    "url": "https://www.blogger.com/profile/18334325508115717169",
    "image": {
     "url": "//lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35"
    }
   },
   "replies": {
    "totalItems": "0",
    "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/9116452149837546851/comments"
   }
  },
  {
   "kind": "blogger#post",
   "id": "4820198897522444689",
   "blog": {
    "id": "8520"
   },
   "published": "2019-01-22T10:00:00-05:00",
   "updated": "2019-01-22T10:55:51-05:00",
   "etag": "'iHf3yWDE_geBgZ8U7rgZ_xuTeAQ/dGltZXN0YW1wOiAxNTQ4MTcyNTUxNTI2Cm9mZnNldDogLTE4MDAwMDAwCg'",
   "url": "http://pyfound.blogspot.com/2019/01/python-software-foundation-fellow.html",
   "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/4820198897522444689",
   "title": "Python Software Foundation Fellow Members for Q4 2018",
   "content": "It's a new year and we are happy to announce our newest PSF Fellow Members!Elana Hashman Github, Twitter, BlogAlexander Hendorf Zachary Ware GithubJeff TriplettGithub, Twitter, WebsiteCongratulations! Thank you for your continued contributions. We have added you to our Fellow roster online.The above members have contributed to the Python ecosystem by maintaining popular libraries/tools, organizing Python events, contributing to CPython, and overall being great mentors in our community. Each of them continues to help make Python more accessible around the world. To learn more about the new Fellow members, check out their links above.Let's continue to recognize Pythonistas all over the world for their impact on our community. Here's the criteria our Work Group uses to review nominations:For those who have served the Python community by creating and/or maintaining various engineering/design contributions, the following statement should be true:Nominated Person has served the Python community by making available code, tests, documentation, or design, either in a Python implementation or in a Python ecosystem project, that 1) shows technical excellence, 2) is an example of software engineering principles and best practices, and 3) has achieved widespread usage or acclaim.For those who have served the Python community by coordinating, organizing, teaching, writing, and evangelizing, the following statement should be true:Nominated Person has served the Python community through extraordinary efforts in organizing Python events, publicly promoting Python, and teaching and coordinating others. Nominated Person's efforts have shown leadership and resulted in long-lasting and substantial gains in the number and quality of Python users, and have been widely recognized as being above and beyond normal volunteering.If someone is not accepted to be a fellow in the quarter they were nominated for, they will remain an active nominee for 1 year for future consideration.It is suggested/recommended that the nominee have wide Python community involvement. Examples would be (not a complete list - just examples):Someone who has received a Community Service Award or Distinguished Service AwardA developer that writes (more than one) documentation/books/tutorials for wider audienceSomeone that helps translate (more than one) documentation/books/tutorials for better inclusivityAn instructor that teaches Python related tutorials in various regionsSomeone that helps organize local meet ups and also helps organize a regional conferenceNominees should be aware of the Python community’s Code of Conduct and should have a record of fostering the community.Sitting members of the PSF Board of Directors can be nominated if they meet the above criteria.If you would like to nominate someone to be a PSF Fellow, please send a description of their Python accomplishments and their email address to psf-fellow at python.org. We are accepting nominations for quarter 1 through February 20, 2019. More information is available at: https://www.python.org/psf/fellows/.",
   "author": {
    "id": "18334325508115717169",
    "displayName": "Ewa Jodlowska",
    "url": "https://www.blogger.com/profile/18334325508115717169",
    "image": {
     "url": "//lh3.googleusercontent.com/zFdxGE77vvD2w5xHy6jkVuElKv-U9_9qLkRYK8OnbDeJPtjSZ82UPq5w6hJ-SA=s35"
    }
   },
   "replies": {
    "totalItems": "0",
    "selfLink": "https://www.googleapis.com/blogger/v3/blogs/8520/posts/4820198897522444689/comments"
   }
  }
 ],
 "etag": "'iHf3yWDE_geBgZ8U7rgZ_xuTeAQ/MjAxOS0wNC0wNFQxOTowODowOC43NzFa'"
}
